haliwt/Drv8302_mkv46f256vlh16_servo/main.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause  MKV46F256VLH16
 */

/*System includes.*/


/* Freescale includes. */
#include "fsl_device_registers.h"
#include "fsl_debug_console.h"
#include "board.h"
#include <stdio.h>
#include "fsl_debug_console.h"

#include "fsl_pwm.h"
#include "pin_mux.h"
#include "fsl_xbara.h"
#include "led.h"
#include "key.h"
#include "bsp_bldc.h"
#include "adc.h"
#include "pollingusart.h"
#include "output.h"
#include "input.h"
#include "hall.h"
#include "bsp_encoder.h"
#include "fsl_xbara.h"
#include "fsl_enc.h"
#include "bsp_algorithm.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
__IO int32_t HALL_Pulse;  

output_t  motor_ref;
encoder_t en_t;
int32_t PID_Result;
PID_TypeDef  sPID;
__IO int32_t  PID_PWM_Duty;
BLDC_Typedef BLDCMotor;

struct _pid_reference pid_r={0.1f,0.01f,0.4f,0.5f,0.01f,0.5f};
/*******************************************************************************
 *
 * Code
 *
 * @brief Main function
 *
******************************************************************************/
int main(void)
{
    
     enc_config_t mEncConfigStruct;
	 volatile int32_t dError_sum,dvError_sum;
	 volatile int32_t iError,last_iError,ivError,last_ivError ;
    
 
     uint8_t ucKeyCode=0;
     uint8_t RxBuffer[8],i,k0,judge_n=0;
     uint16_t z=0,ldectnum=0, tempadd,m=0;

	 volatile int16_t DectBuf[6];
     volatile uint16_t Time_CNT,EnBuf[2]={0,0};
	 volatile int32_t mCurPosValue=0,mHoldPos=0,HDff,VDff,Dff;
	 uint32_t eIn_n= 0,mn=0,lstartHorValue=0,lhoradd;
	 int16_t j=0,ldiff,lkeydir, lverticalpos,lhorizonpos,lstarthor;
   
    XBARA_Init(XBARA);
    BOARD_InitPins();
    BOARD_BootClockRUN();
    BOARD_InitDebugConsole();
 
    
     LED_Init();
     KEY_Init();
     DelayInit();
     HALL_Init();
     Capture_Input_Init();

   
    OUTPUT_Fucntion_Init();
    ADC_CADC_Init();
   
	
    /* Set the PWM Fault inputs to a low value */
    PWM_BLDC_Init();
   // USART_POLLING_Init();
     #if 1  //no interrupt
    /* Initialize the ENC module. */
    ENC_GetDefaultConfig(&mEncConfigStruct);
    ENC_Init(DEMO_ENC_BASEADDR, &mEncConfigStruct);
    ENC_DoSoftwareLoadInitialPositionValue(DEMO_ENC_BASEADDR); /* Update the position counter with initial value. */
    #endif
	Dir=3;
    en_t.First_V_dec =0;
    en_t.First_H_dec =0;
	en_t.HorizonStop_flag=0;
	
   while(1)
   {
    ucKeyCode = KEY_Scan(0);

    mHoldPos = ENC_GetHoldPositionValue(DEMO_ENC_BASEADDR);
	en_t.Pos_diff = (int16_t)ENC_GetHoldPositionDifferenceValue(DEMO_ENC_BASEADDR);
       
	
	//	  printf("currePosHold: %ld\r\n", mHoldPos);
	//     printf("position diff = %d\r\n", en_t.Pos_diff);
    //      printf("en_t.eInit_n: %d\r\n", en_t.eInit_n);
	 
#if 1
	 /***********Position :Home and End*****************/
        if(en_t.eInit_n ==0)
        {
            printf("itself %%%%%%%%%%%%%\r\n"); 
            PWM_Duty=50 ;
			LED2=!LED2;
			if(eIn_n >= 3){
                  
				   j++;
                   if(j==1){
                            EnBuf[0]=mHoldPos;
                            
							   }
				   else if(j==3){
				   			EnBuf[1]= mCurPosValue;
                           }

                   if(j==3){  /*judge and setup this Home and End Position */
					
			               if((EnBuf[0]==EnBuf[1])){
                     			/*judge home and end position twice*/
                             printf("################################################################################# \n");
                              printf("################################################################################# \n");
                               printf("################################################################################# \n");
                                PMW_AllClose_ABC_Channel();
                                motor_ref.motor_run = 0;
								/*To judge  Home position and End position*/
								
								 if(Dir ==0){/*motor to honrizon Position*/
								 	    judge_n++; 
							    		PRINTF("Horizon judge_n = %d\r\n",judge_n);
								 		if((judge_n==1||judge_n==3)){
											 
										      
													en_t.First_H_dec = 1;
													en_t.oneKey_H_flag =1;
													
					
													printf("HorizPos_1 = %d\r\n",en_t.Horizon_Position);
													HALL_Pulse =0;
													if(abs(en_t.Horizon_Position)< 200 ){
														Dir =0 ; /* motor move horizon  */
														PWM_Duty =50 ;
														motor_ref.motor_run = 1;
														printf("HorizonPos 1!!!!!! =%d \r\n",en_t.Horizon_Position);
													}
													else if(abs(en_t.Horizon_Position) > 800){
														/* one key study*/
														Dir =1 ; /* motor move vertical  */
														PWM_Duty =50 ;
													    motor_ref.motor_run = 1;
		                                                printf("HorizonPos 1_3 =%d \r\n",en_t.Horizon_Position);
														if(abs(en_t.Horizon_Position) <800)
															en_t.Horizon_Position=1024;
													}
													
												
								 			}
										else{ /*judge_n ==2,from vertical to horizon position*/
												PRINTF("judge_n = %d\r\n",judge_n);
												if((judge_n==2)||(judge_n==4)){

												     if(judge_n ==4)judge_n =2;
													en_t.End_H_flag = 1;
													en_t.Horizon_Position = mHoldPos;
													 HALL_Pulse =0;
													PRINTF("HorizonPos_2 = %d\r\n",en_t.Horizon_Position);
													if(abs(en_t.Horizon_Position) > 800){
	 													Dir =0 ; /* motor move horizon  */
														PWM_Duty =50;
														motor_ref.motor_run = 1;
													    printf("Hor_2_0 = %d\r\n",en_t.Horizon_Position);

													    }
													
													else if(abs(en_t.Horizon_Position) < 200){
													/* one key study*/
													Dir =1 ; /* motor move horizon  */
													PWM_Duty =50;
													motor_ref.motor_run = 1;
													printf("Hor_4_0 = %d\r\n",en_t.Horizon_Position);
													}
												  
