haliwt/Drv8302_mkv46f256vlh16_servo/main.c
					}
							
               	 }
                 else if(abs(en_t.Horizon_Position)  < 200  && en_t.oneKey_V_flag !=1){
							    printf("Horizon_Pos <200 @@@@@@\r\n");
								mCurPosValue = ENC_GetPositionValue(DEMO_ENC_BASEADDR); /*read current position of value*/
								printf("200mCurrPos = %d \r\n",mCurPosValue);
								printf("200PWM_Duty = %d \r\n",PWM_Duty);
								ldiff = abs(mCurPosValue);
		
								if(ldiff > 800 ){
								for(z=0;z<100;z++){
			                    Dir =1;
			                    PWM_Duty =30;
			                    uwStep = HallSensor_GetPinState();
			                    HALLSensor_Detected_BLDC(PWM_Duty);
								printf("HorStartPos-1 : %ld\r\n", mCurPosValue);
			                    Dir =0;
								en_t.mini_value =2;
							   }
							   break;		

						}
								
				     }
                  else if(en_t.oneKey_V_flag ==1){

				  	            ldiff = abs(mCurPosValue);
								if(ldiff < 200 ){
								for(z=0;z<100;z++){
			                    Dir =1;
			                    PWM_Duty =30;
			                    uwStep = HallSensor_GetPinState();
			                    HALLSensor_Detected_BLDC(PWM_Duty);
								printf("HorStartPos-1 : %ld\r\n", mCurPosValue);
			                    Dir =0;
								en_t.mini_value =2;
							   }
									PWM_Duty=0; 	

						}

				  
                  	}
                 #endif 
				} //end if(Dir ==0)
       
              }//end if(en_t.eIn_n == 0)
			
		#endif 
				 if(Dir==0)
				  	{
						  uwStep = HallSensor_GetPinState();
				          HALLSensor_Detected_BLDC(PWM_Duty);
				  	}
				  else{
				  	       uwStep = HallSensor_GetPinState();
				          HALLSensor_Detected_BLDC(PWM_Duty);
				  	}
			
			
	      mCurPosValue = ENC_GetPositionValue(DEMO_ENC_BASEADDR); /*read current position of value*/
	      en_t.Pos_diff = (int16_t)ENC_GetHoldPositionDifferenceValue(DEMO_ENC_BASEADDR);
#if 1
           if(Dir == 0)
		  	{
           printf("judge_n = %d \r\n",judge_n);
           printf("run_HALL_dir = %ld\r\n", HALL_Pulse);
   		   printf("motor start pwm= %d\r\n",PWM_Duty);
		   printf("motor Dir = %d\n",Dir);
		   printf("VerticalPos = %ld\r\n",en_t.Vertical_Position);
		   printf("HorzionPos = %ld\r\n",en_t.Horizon_Position);
           printf("POS_diff = %d \r\n", en_t.Pos_diff);
           printf("en_t.eInit_n: %d\r\n", en_t.eInit_n);
		  }
		   
#endif 
		    if(en_t.HorizonStop_flag ==1 && en_t.eInit_n ==1){

						mCurPosValue = ENC_GetPositionValue(DEMO_ENC_BASEADDR); /*read current position of value*/
						lhorizonpos =abs(abs(en_t.Horizon_Position) - abs(mCurPosValue));
						
						printf("stop lhorizonpos = %d \n",lhorizonpos);
					    if(lhorizonpos <=300 ||lhorizonpos > 700){

						for(z=0;z<150;z++){
						Dir =1;
						PWM_Duty =30;
						uwStep = HallSensor_GetPinState();
						HALLSensor_Detected_BLDC(PWM_Duty);
						printf("HorStopPos flag=1 300 : %d\r\n", mCurPosValue);
						Dir =0;
						PWM_Duty=0; 
						uwStep = HallSensor_GetPinState();
						HALLSensor_Detected_BLDC(PWM_Duty);
						DelayMs(2);
						mCurPosValue = ENC_GetPositionValue(DEMO_ENC_BASEADDR);
						if(abs(mCurPosValue)==(abs(en_t.Horizon_Position -150))||abs(mCurPosValue)>(abs(en_t.Horizon_Position)-150))
				        en_t.HorizonStop_flag =2;
						}
						PWM_Duty=0; 
					}
					
			     }
		   eIn_n ++; 
           if(eIn_n > 0xffffe){
            
		       if(en_t.eInit_n ==1) eIn_n = 1;
               else eIn_n =0 ;
           }
           Time_CNT++;
#if 1    
        /* 100ms arithmetic PID */
    	if((Time_CNT % 25== 0)&&(en_t.eInit_n == 1)&&(en_t.HorizonStop_flag !=2)&&(en_t.HorizonStop_flag !=1)){
   
            PRINTF("HorizonStandPos: %d\r\n", en_t.Horizon_Position);
			mCurPosValue = ENC_GetPositionValue(DEMO_ENC_BASEADDR); /*read current position of value*/
			printf("mCurPosValue TIme_cnt = %d \r\n",mCurPosValue);
			if(Dir == 0)//CCW HB0 = Horizion
			{
						en_t.DIR_flag =0;

						#if 0
                        lhoradd ++;
                        if(lhoradd > 500) {
                             lhoradd=lhoradd  - 500;
						     tempadd  = 50 + lhoradd;
                             
                        }
                        
						for(i=0;i<tempadd;i++){
							Dir =1;
	                        PWM_Duty =30;
	                        uwStep = HallSensor_GetPinState();
	                        HALLSensor_Detected_BLDC(PWM_Duty);
							Dir =0;
                            printf(" tempadd \\\\\\ =  %d \n", tempadd);
						
	                        if(tempadd >=50)tempadd =0;
							printf("lhoradd!!!!!!!!!!!!!!!!!! = %d \n",lhoradd);
							}
						#endif 
						
						iError =abs(mCurPosValue) - abs(en_t.Horizon_Position) ; /*  pid error  */
					    printf("mCurPosValue= %ld \n\r",mCurPosValue);
						printf("iError = %ld \r\n",iError);
					    if(abs(en_t.Horizon_Position) < 200){/*refer vertical*/
						    lhorizonpos = abs(mCurPosValue);
                             if(lhorizonpos <=300){
                            for(z=0;z<400;z++){
                            Dir =1;
                            PWM_Duty =30;
                            uwStep = HallSensor_GetPinState();
                            HALLSensor_Detected_BLDC(PWM_Duty);
							
                             Dir =0;
                             PWM_Duty =0;
                             uwStep = HallSensor_GetPinState();
                            HALLSensor_Detected_BLDC(PWM_Duty);
                            DelayMs(2);
                              printf("Stop300 CurrPos : %ld\r\n", mCurPosValue);
							  en_t.HorizonStop_flag =1;
							}
							 lhoradd=0;
							 tempadd=0;
						   }
							 HALL_Pulse =0;	
							
							 
						}
						else if(abs(en_t.Horizon_Position) >800 && (en_t.Pos_diff > 0)){

								lhorizonpos =abs(mCurPosValue);
							    if(lhorizonpos > 700){
							  //  en_t.HorizonStop_flag =2;
	                            for(z=0;z<150;z++){
		                            Dir =1;
		                            PWM_Duty =30;
		                            uwStep = HallSensor_GetPinState();
		                            HALLSensor_Detected_BLDC(PWM_Duty);
		                            Dir =0;
                                    
                                     PWM_Duty =0;
                                     uwStep = HallSensor_GetPinState();
                                    HALLSensor_Detected_BLDC(PWM_Duty);
                                    DelayMs(1);
									printf("Stop800 CurrPos : %ld\r\n", mCurPosValue);
									lhoradd=0;
									 tempadd=0;
                                }
								PWM_Duty = 0;
								en_t.HorizonStop_flag =1;
								dError_sum = 0;
									iError=0;
								 last_iError =0;
						   }
							 HALL_Pulse =0;					

